#+TITLE: Implementation

* base example

# Why I chose an example for explanation?
To my knowledge it is easiest to understand a new topic with a
concrete example.  Therefore I would like to explain the inernals of
the compiler with an example.  The example that I choose should be an
example that is easy to understand, could be part of a real program
and it should cover many features that I want to support.

# What is the example about?
In listing ref:base-example I show an example that I want to make
executable over the course of this mater thesis.  It renders a mesh
with texture mapping and vertex-normals.  In the vertex shader the
lighting is calculated by a loop that iterates all light sources.

Features this example covers:

  * uniforms
  * attributes
  * non-builtin types (Light)
  * for loop (iterator)

#+caption: Base Example label:base-example
#+BEGIN_SRC nim
import glm, macros

macro render(args: varargs[untyped]): untyped =
  for arg in args:
    echo arg.treeRepr

type
  Mesh[T] = object
  Framebuffer[T] = object
  Texture2D = object

type
  MyFragmentType = object
    color: Vec4f

  MyVertexType = object
    position_os: Vec4f
    normal_os: Vec4f
    texCoord: Vec2f

  Light = object
    position_ws : Vec4f
    color : Vec4f

  MyMesh        = Mesh[MyVertexType]
  MyFramebuffer = Framebuffer[MyFragmentType]

var myTexture: Texture2D
var mesh: MyMesh
var framebuffer: MyFramebuffer
var mvp: Mat4f

var M,V,P: Mat4f
var lights: array[10,Light]

framebuffer.render(mesh) do (v, gl):
  gl.Position     = (P * V * M) * v.position_os
  let position_cs = V*M*v.position_os
  let normal_cs   = inverse(transpose(V*M)) * v.normal_os
  var lighting: Vec4f

  ## rasterize

  for light in lights:
    let light_position_cs = V * light.position_ws
    let light_direction_cs = light_position_cs-position_cs
    let light_intensity = dot(light_direction_cs, normal_cs)
    lighting += light_intensity * light.color

  let textureSample = texture(myTexture, v.texCoord)
  result.color = textureSample * lighting

#+END_SRC

#+RESULTS:
: HalloWelt...

# how the nim typechecker works, and why I create the outer macro.
The typechecker in Nim can only check types of the Nim programming
language with semantics of the Nim programming language.  The
typechecking algorithm itself is not scriptable.  Therefore I need to
map glsl semantics somehow to the Nim programming language.  Most glsl
types map nicely to the types defined in the glm library.  Then the
glsl part needs to have some context for the typechecker that I inject
with a two layer macro (where the full will you talk about it).

From here on I assume that all types of glsl also work flawlessly in
Nim.  For more details on how this works see the glsl section.

In order for the typecheck to be able to resolve all symbols correctly
I use the pattern with a two layer macro.  The outer macro takes a
non-typechecked AST, and then generates an AST that is capabale to be
fully typechecked.  The then generated AST is a statment to a typed
macro.  With this pattern it is possible to introduce symbols that
only exist in the embedded DSL.  In the listings ref:two-layer-macro-a
and ref:two-layer-macro-a you see how I introduce the symbol ~gl~ with
this pattern.

#+caption: Two Layer Macro A label:two-layer-macro-a
#+BEGIN_SRC nim
framebuffer.render(mesh) do (v):
  gl.Position     = (P * V * M) * v.position_os
  #[...]#
#+END_SRC

This will be transformed into the following statement:

#+caption: Two Layer Macro B label:two-layer-macro-b
#+BEGIN_SRC nim
block:  # A code block to create a new variable scope.
  gl: var GlShaderContext {.inject.} # inject to prevent symbol hiding hygienic
  render_inner(framebuffer, mesh) do (v: MyVertexType) -> MyFragmentType:
    gl.Position     = (P * V * M) * v.position_os
    #[ ... ]#
#+END_SRC

Now the type checker can resolve all symbols from the inner body of
this macro.  The typechecked AST is reprinted here again in nim representation.

#+BEGIN_EXAMPLE

do (v: MyVertexType; gl: var GlShaderContext) -> MyFragmentType:
  gl.Position = P * V * M * v.position_os
  let position_cs = V * M * v.position_os
  let normal_cs = inverse(transpose(V * M)) * v.normal_os
  var lighting: Vec4f
  block tmp346054:
      var light: Light
      var i = 0
      if i <= 9:
        block tmp346055:
            while true:
              light = lights[i]
              let light_position_cs = V * light.position_ws
              let light_direction_cs = light_position_cs - position_cs
              let light_intensity = dot(light_direction_cs, normal_cs)
              lighting += light_intensity * light.color
              if 9 <= i:
                break tmp346055
              inc(i, 1)
  let textureSample = texture(myTexture, v.texCoord, 0.0)
  result.color = textureSample * lighting

#+END_EXAMPLE

For representation alone it is not obvious that it is now a tree
of resolved symbols, but the full tree would be too large to be shown
here. This is only the last last line printed in tree representation:

#+BEGIN_EXAMPLE
  Asgn
    DotExpr
      Sym "result"
      Sym "color"
    Infix
      Sym "*"
      Sym "textureSample"
      Sym "lighting"

#+END_EXAMPLE

I don't know what to do to prevent that the for loop becomes a while
loop.  Should I filter for this while loop and translate it back to a
for loop in glsl? Or should I just translate into a while loop and
hope the glsl compiler will be able to unroll it anyway?  Glsl
performance might really suffer from dynamically sized arrays, but
this should really be tested,  I did not test it at all yet.

